using SiliconStepe.Models;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

using Xamarin.Forms;
using Xamarin.Forms.Xaml;

namespace SiliconStepe.Views
{
	[XamlCompilation(XamlCompilationOptions.Compile)]
	public partial class FaqPage : ContentPage
	{
        public List<FaqModel> FaqList { get; set; } = new List<FaqModel>()
        {
            new FaqModel()
            {
                Question = "Может ли быть составлен протокол об административном правонарушении в отсутствие лица, в отношении которого возбуждено дело об административном правонарушении?",
                Answer = "В соответствие постановления Пленума Верховного суда РФ «О некоторых вопросах, возникающих у судов при применении Кодекса Российской Федерации об административных правонарушениях» № 5 от 24.03.2005г., протокол об административном правонарушении может быть составлен в отсутствие лица, в отношении которого возбуждено дело об административном правонарушении, если этому лицу было надлежащим образом сообщено о времени и месте его составления, но оно не явилось в назначенный срок и не уведомило о причинах неявки или причины неявки были признаны неуважительными.",

            },
            new FaqModel()
            {
                Question = "Будет ли наложен штраф в случае отказа правонарушителя от подписи протокола и в случае его неявки на рассмотрение административного дела?",
                Answer = "В случае если правонарушитель отказался от подписи, то об этом делается соответствующая запись государственным инспектором в протоколе об административном правонарушении (ст. 28. 2 КоАП РФ). При неявке нарушителя на рассмотрение административного дела оно может быть рассмотрено в его отсутствие (ст. 25. 1 КоАП РФ), но только в том случае, если привлекаемое к административной ответственности лицо (законный представитель) были надлежащим образом уведомлены о месте и времени рассмотрения дела по существу. Должностное лицо вправе признать явку лица (законного представителя) на рассмотрение дела обязательной.",
            },
            new FaqModel()
            {
                Question = "Исходя из чего, устанавливается величина налагаемого на правонарушителя штрафа?",
                Answer = "Размер административного штрафа за совершение административного правонарушения назначается в пределах установленных законом размеров. При назначении административного наказания учитываются характер совершенного им административного правонарушения, личность виновного, его имущественное положение, финансовое положение юридического лица, обстоятельства, смягчающие административную ответственность, и обстоятельства, отягчающие административную ответственность.",
            },
            new FaqModel()
            {
                Question = "В какой срок и кому может быть обжаловано постановление о наложении административного наказания, вынесенное государственным инспектором по пожарному надзору в отношении юридического лица и индивидуального предпринимателя?",
                Answer = "В соответствии статьи 30.3 КоАП РФ, жалоба на постановление о наложении административного наказания может быть подана в течение десяти суток со дня вручения или получения копии постановления. В случае пропуска срока обжалования, указанный срок по ходатайству лица, подающего жалобу, может быть восстановлен лицом, правомочным рассматривать жалобу. В соответствии статьи 30.1 КоАП РФ постановление о наложении административного наказания, вынесенное государственным инспектором по пожарному надзору в отношении юридического лица и индивидуального предпринимателя, может быть обжаловано в вышестоящий орган, вышестоящему должностному лицу и в арбитражный суд, в соответствии с арбитражным процессуальным законодательством.",
            },
            new FaqModel()
            {
                Question = "Можно ли отсрочить или рассрочить исполнение постановление о наложении административного наказания, в части уплаты административного штрафа?",
                Answer = "При наличии обстоятельств, вследствие которых исполнение постановления о назначении административного наказания в виде административного штрафа невозможно в установленные срок, должностное лицо, вынесшее постановление, могут отсрочить уплату административного штрафа на срок до одного месяца. С учетом материального положения лица, привлеченного к административной ответственности, уплата административного штрафа может быть рассрочена должностным лицом, вынесшим постановление, на срок до трех месяцев.",
            },
        };
		public FaqPage ()
		{
			InitializeComponent ();
            BindingContext = this;
		}
        private void ListView_ItemTapped(object sender, ItemTappedEventArgs e)
        {
            (sender as ListView).SelectedItem = null;
        }
    }
}